In [87]:
import pandas as pd
import matplotlib.pyplot as plt
df14_111 = pd.read_excel('/Users/mayapatel/Desktop/honours/rawdata/2014-15 WT1 Phys 111 ALL Data - Shared with Chelsea (20210212).xlsx', nrows=256)
df14_112 = pd.read_excel('/Users/mayapatel/Desktop/honours/rawdata/2014-15 WT1 Phys 112 ALL Data - Shared with Chelsea (20210212).xlsx')
df15_111 = pd.read_excel('/Users/mayapatel/Desktop/honours/rawdata/2015-16 WT1 Phys 111 ALL Data - Shared with Chelsea.xlsx')
print(len(df14_111))
print(len(df14_112))
print(len(df15_111))
df14_111.head()

256
460
215

,Session,Course,Lecture,Secondary,Percent Grade,Letter Grade,PRE Q1,PRE Q2,PRE Q3,PRE Q4,...,POST Q87,POST Q88,POST Q89,POST Q90,POST Q91,POST Q92,POST Q93,POST Q94,POST Q95,POST Q96
0,2014W,111.0,1.0,L02,70.0,B-,C,D,D,A,...,A,C,C,E,D,C,A,C,B,BLANK
1,2014W,111.0,1.0,XMT,66.0,C+,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2014W,111.0,1.0,L10,74.0,B,A,A,C,A,...,B,B,A,D,A,A,B,C,B,BLANK
3,2014W,111.0,1.0,L02,78.0,B+,C,A,C,E,...,A,A,A,D,D,A,C,E,A,BLANK
4,2014W,111.0,1.0,L09,60.0,C,C,A,C,E,...,B,B,E,A,C,C,A,D,A,BLANK

In [2]:
df14_111.mean(axis=0)

Course           111.000000
Lecture            1.384314
Percent Grade     69.474510
dtype: float64

In [3]:
df15_111.mean(axis=0)

Course              111.000000
Lecture               1.427907
Tertiary Section           NaN
Percent Grade        71.400000
dtype: float64

In [4]:
df14_111.count(axis=1)

0      117
1        6
2      117
3      117
4      117
      ...
251    117
252     68
253      6
254      6
255      0
Length: 256, dtype: int64

In [5]:
y14_q1 = pd.DataFrame(df14_111['PRE Q1'].value_counts(dropna=False))
y15_q1 = pd.DataFrame(df15_111['PRE Q1'].value_counts(dropna=False))
y14_q1_112 = pd.DataFrame(df14_112['PRE Q1'].value_counts(dropna=False))

dff1 = y14_q1.join(y15_q1, lsuffix='2014-15', rsuffix='2015-16')
dff1 = dff1.join(y14_q1_112, rsuffix='2014 112')
dff1

#correct answer = C

     PRE Q12014-15  PRE Q12015-16  PRE Q1
C              115            156      98
NaN            103              3     254
D               14             20      44
A               13             26      30
B                8              6      19
E                3              4      15

In [6]:
y14_q1_post = pd.DataFrame(df14_111['POST Q1'].value_counts(dropna=False))
y15_q1_post = pd.DataFrame(df15_111['POST Q1'].value_counts(dropna=False))
y14_q1_112_post = pd.DataFrame(df14_112['POST Q1'].value_counts(dropna=False))

dff2 = y14_q1_post.join(y15_q1_post, lsuffix='2014-15', rsuffix='2015-16')
dff2 = dff2.join(y14_q1_112_post, rsuffix='2014 112')

display(dff1.join(dff2))

#correct answer = C

,PRE Q12014-15,PRE Q12015-16,PRE Q1,POST Q12014-15,POST Q12015-16,POST Q1
C,115,156,98,112,139,80
NaN,103,3,254,105,25,262
D,14,20,44,13,21,26
A,13,26,30,16,17,52
B,8,6,19,8,11,34
E,3,4,15,2,1,6

In [7]:
y14_q2 = pd.DataFrame(df14_111['PRE Q2'].value_counts(dropna=False))
y15_q2 = pd.DataFrame(df15_111['PRE Q2'].value_counts(dropna=False))
y14_q2_112 = pd.DataFrame(df14_112['PRE Q2'].value_counts(dropna=False))

dff = y14_q2.join(y15_q2, lsuffix='2014-15', rsuffix='2015-16')
dff.join(y14_q2_112, rsuffix='2014 112')

#correct answer = A

     PRE Q22014-15  PRE Q22015-16  PRE Q2
NaN            103            3.0     254
A               83           99.0      59
D               34           55.0      81
B               22           39.0      40
E                7            6.0      14
C                6           11.0      11
!!               1            NaN       1

In [8]:
y14_q3 = pd.DataFrame(df14_111['PRE Q3'].value_counts(dropna=False))
y15_q3 = pd.DataFrame(df15_111['PRE Q3'].value_counts(dropna=False))
y14_q3_112 = pd.DataFrame(df14_112['PRE Q3'].value_counts(dropna=False))

dff = y14_q3.join(y15_q3, lsuffix='2014-15', rsuffix='2015-16')
dff.join(y14_q3_112, rsuffix='2014 112')

#correct answer = C

     PRE Q32014-15  PRE Q32015-16  PRE Q3
C              105            145      97
NaN            103              3     254
B               21             26      34
A               17             32      51
E                7              5      17
D                3              4       7

In [9]:
y14_q4 = pd.DataFrame(df14_111['PRE Q4'].value_counts(dropna=False))
y15_q4 = pd.DataFrame(df15_111['PRE Q4'].value_counts(dropna=False))
y14_q4_112 = pd.DataFrame(df14_112['PRE Q4'].value_counts(dropna=False))

dff = y14_q4.join(y15_q3, lsuffix='2014-15', rsuffix='2015-16')
dff.join(y14_q3_112, rsuffix='2014 112')

#correct answer = E

     PRE Q4  PRE Q3  PRE Q32014 112
NaN     103       3             254
A        87      32              51
E        64       5              17
D         2       4               7

In [10]:
q_ans = df14_111.count(axis=1)
q = []
i=0
while q_ans[i]<50:
    q.append(q_ans[i])
    i+=1

q

[]

In [43]:

stu1_df14_111_pre = [] 
for i in range(1,31):
    string = "PRE Q"+ str(i)
    stu1_df14_111_pre += df14_111[string].iloc[0]
print(stu1_df14_111_pre)

['C', 'D', 'D', 'A', 'D', 'B', 'B', 'B', 'B', 'E', 'C', 'B', 'C', 'B', 'C', 'C', 'A', 'E', 'E', 'A', 'C', 'B', 'C', 'A', 'E', 'A', 'A', 'E', 'B', 'B']

In [68]:
corr_ans = ['C', 'A' , 'C', 'E', 'B', 'B', 'B', 'B' , 'E', 'A', 'D', 'B', 'D', 'D', 'A', 'A', 'B', 'B', 'E', 'D', 
            'E', 'B', 'B', 'A', 'C', 'E', 'C', 'E', 'B', 'C']

In [69]:
for i in range(len(stu1_df14_111_pre)):
    if corr_ans[i]==stu1_df14_111_pre[i]:
        stu1_df14_111_pre_score += 1  
stu1_df14_111_pre_score

20

In [79]:
sample_arg = df14_111.iloc[56]
def calculate_score(student):
    student_pre = [] 
    score = 0
    for i in range(1,31):
        string = "PRE Q"+ str(i)
        if string in student:
            if student[string]==corr_ans[i-1]:
                score+=1
            
    return score

In [80]:
calculate_score(sample_arg)

17

In [90]:
df14_111.apply(calculate_score, axis=1).mean()*100/30

32.265625

In [91]:
df14_111.describe()

       Course     Lecture  Percent Grade
count   255.0  255.000000     255.000000
mean    111.0    1.384314      69.474510
std       0.0    0.487389      17.289064
min     111.0    1.000000       3.000000
25%     111.0    1.000000      61.000000
50%     111.0    1.000000      71.000000
75%     111.0    2.000000      81.000000
max     111.0    2.000000     100.000000

In [2]:
#heloo